{
    "tool_name": "Enrichr Links",
    "tool_string": "enrichr",
    "tool_description": "Links to enrichment analysis results of the differentially expressed genes via Enrichr",
    "introduction": "Enrichment analysis is a statistical procedure used to identify biological terms which are over-represented in a given gene set. These include signaling pathways, molecular functions, diseases, and a wide variety of other biological terms obtained by integrating prior knowledge of gene function from multiple resources. Enrichr is a web-based application which allows to perform enrichment analysis using a large collection of gene-set libraries and various interactive approaches to display enrichment results.",
    "methods": "The up-regulated and down-regulated gene sets were generated by extracting the {geneset_size} genes with the respectively highest and lowest values from the gene expression signature. The gene sets were subsequently submitted to Enrichr (<a href='10.1093/nar/gkw377'>Kuleshov et al., 2016</a>), which is freely available at <a href='http://amp.pharm.mssm.edu/Enrichr/'>http://amp.pharm.mssm.edu/Enrichr/</a>, using the gene set upload API. For more information on the methods used to generate the signature, see the Differential Gene Expression section.",
    "result_description": "The Enrichr Links plug-in embeds links to the Enrichr web server which contain the results of enrichment analyses generated by analyzing the up-regulated genes and down-regulated genes identified from the Control vs Perturbation signature. By clicking on these links, users can interactively explore and download the results of the analysis.",
    "reference_link": "https://dx.doi.org/10.1093/nar/gkw377",
    "video_tutorial": "https://www.youtube.com/watch?v=HfUZdNJ9a3A&t=37s",
    "input": "signature",
    "requires_signature": 1,
    "parameters": [
        {
            "parameter_name": "Gene Set Size",
            "parameter_description": "Size of the gene set to be extracted to perform enrichment analysis",
            "parameter_string": "geneset_size",
            "parameter_type": "int",
            "values": [
                {
                    "value": "100",
                    "default": 0
                },
                {
                    "value": "250",
                    "default": 0
                },
                {
                    "value": "500",
                    "default": 1
                }
            ]
        }
    ]
}